#main Ajax#
main.title=\uc8fc\uc694 \uae30\ub2a5 \uc124\uba85
Restful=\uc77c\ubc18\uc801\uc73c\ub85c URL\uc744 \ud1b5\ud574 action\uc744 \ub9e4\ud551\ud558\ub294 \uac83\uc774 \uc544\ub2cc HTTP method\ub97c \uc774\uc6a9\ud558\uc5ec \ub9e4\ud551\ud558\ub294 \uac83\uc744 Restful\uc774\ub77c \ud55c\ub2e4.<br>\uba54\uc18c\ub4dc\ub97c @RequestMapping \uc5b4\ub178\ud14c\uc774\uc158\uc744 \uc774\uc6a9\ud574\uc11c \uc124\uc815\ud558\uace0 \uac01 \uc2e4\ud589 \uba54\uc18c\ub4dc\ub294 @RequestMapping\uc5d0 \uc815\uc758\ub41c \uba54\uc18c\ub4dc\ub97c \uae30\uc900\uc73c\ub85c \ud55c\ub2e4.<br>\uc2a4\ud504\ub9c13.0\uc740 GET, POST, HEAD, PUT, DELETE \uc5d0 \ub300\ud55c \uc694\uccad\uc744 \uc218\ud589\ud55c\ub2e4. \uac19\uc740 URI\ub85c \uc694\uccad\uc744 \ud574\ub3c4 \uc694\uccad \ubc29\uc2dd\uc5d0 \ub530\ub77c \uc751\ub2f5\uc774 \ub2ec\ub77c\uc9c4\ub2e4.<br>(\uce74\ud14c\uace0\ub9ac \uba54\ub274\uc5d0\uc11c \ud655\uc778 \uac00\ub2a5 - ContentNegotiatingViewResolver\ub97c \uc774\uc6a9\ud574 html, xml, json\uc73c\ub85c \uc751\ub2f5\uc774 \uac00\ub2a5 \ud558\ub3c4\ub85d \uad6c\ud604 \ub418\uc5b4 \uc788\ub2e4.)
ORM=\ud1b5\ud569\uc608\uc81c\uc5d0\uc11c\ub294 \ud558\uc774\ubc84\ub124\uc774\ud2b8\ub97c \uc774\uc6a9\ud574 ORM\uc744 \uc81c\uacf5\ud55c\ub2e4.<br>(\uce74\ud14c\uace0\ub9ac \uba54\ub274\uc5d0\uc11c \ud655\uc778\uac00\ub2a5)
OXM=OXM(Object-XML Mapping)<br>xml\uacfc \uc790\ubc14 \uc624\ube0c\uc81d\ud2b8\ub97c \ub9e4\uce6d\ud574\uc11c \uc0c1\ud638 \ubcc0\ud658\ud574\uc8fc\ub294 \uae30\uc220<br>Spring3.0\uc5d0\uc11c\ub294 \ub300\ud45c\uc801\uc73c\ub85c \ub2e4\uc74c \ub124\uac00\uc9c0\ub97c \uc0ac\uc6a9\ud55c\ub2e4.<br>1. Castor XML: \uc124\uc815\ud30c\uc77c\uc774 \ud544\uc694\ud558\uc9c0 \uc54a\uc74c<br>2. JiBX: \ub6f0\uc5b4\ub09c \ud37c\ud3ec\uba3c\uc2a4<br>3. XmlBeans: \uc544\ud30c\uce58 XML\ud504\ub85c\uc81d\ud2b8<br>4. Xstream: \uc124\uc815\uc774 \uc5c6\ub294 \ubc14\uc778\ub529\uc744 \uc9c0\uc6d0<br><br>\ud1b5\ud569\uc608\uc81c\uc5d0\uc11c\ub294 Castor XML\uc744 \uc9c0\uc6d0\ud55c\ub2e4.<br>(\uc0c1\ud488\ubaa9\ub85d \ub9ac\uc2a4\ud2b8, \uc804\uccb4 \uad6c\ub9e4 \ubaa9\ub85d \uc870\ud68c \uba54\ub274\uc5d0\uc11c \ud655\uc778 \uac00\ub2a5)<br>
Excel=Excel \ud30c\uc77c \ud3ec\ub9f7\uc744 \ub2e4\ub8f0 \uc218 \uc788\ub294 \uc790\ubc14 \ub77c\uc774\ube0c\ub7ec\ub9ac\ub97c \uc81c\uacf5\ud558\uc5ec, \uc0ac\uc6a9\uc790\ub4e4\uc774 \ub370\uc774\ud130\ub97c Excel \ud30c\uc77c \ud3ec\ub9f7\uc73c\ub85c \ub2e4\uc6b4\ubc1b\uac70\ub098, \ub300\ub7c9\uc758 Excel \ub370\uc774\ud130\ub97c \uc2dc\uc2a4\ud15c\uc5d0 \uc62c\ub9b4 \uc218 \uc788\ub3c4\ub85d \uc9c0\uc6d0\ud558\uae30 \uc704\ud55c \uc11c\ube44\uc2a4\uc774\ub2e4.<br>Excel \uc11c\ube44\uc2a4\ub294 Apache POI \uc624\ud508\uc18c\uc2a4\ub97c \uc0ac\uc6a9\ud558\uc5ec \uad6c\ud604\ud558\uc600\uc73c\uba70, \ud1b5\ud569\uc608\uc81c\uc5d0\uc11c\ub294 \ub2e4\uc6b4\ub85c\ub4dc \uae30\ub2a5\uc744 \uc81c\uacf5\ud55c\ub2e4.<br>(\uc0c1\ud488\ubaa9\ub85d \ub9ac\uc2a4\ud2b8 \uba54\ub274\uc5d0\uc11c \ud655\uc778 \uac00\ub2a5)
